it-service/ssl/Documents/Накладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Накладная</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.Заказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ITСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITСервисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНакладной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

it-service/ssl/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ITСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITСервисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

it-service/ssl/InformationRegisters/ПриоритетыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПриоритетыСкладов</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ITСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITСервисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

it-service/ssl/AccumulationRegisters/Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Заказы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ITСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITСервисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

it-service/ssl/AccumulationRegisters/Поставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Поставки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ITСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITСервисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

it-service/ssl/AccumulationRegisters/ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ITСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITСервисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

it-service/ssl/Enums/ВидыНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНакладной</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приходная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

it-service/ssl/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаОтменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

it-service/ssl/Enums/СпособыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

it-service/ssl/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

it-service/ssl/Documents/Накладная/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		ITСервис = ДанныеЗаполнения.ITСервис;
		Контрагент = ДанныеЗаполнения.Контрагент;
		АдресНазначения = ДанныеЗаполнения.Контрагент.КонтактнаяИнформация;
		Телефон = ДанныеЗаполнения.Контрагент.ОтветственноеЛицо.Телефон;
		СпособОплаты = ДанныеЗаполнения.СпособОплаты;
		Заказ = ДанныеЗаполнения.Ссылка;
		ВидНакладной = Перечисления.ВидыНакладной.Расходная;
		Для Каждого ТекСтрокаСоставЗаказа Из ДанныеЗаполнения.СоставЗаказа Цикл
			НоваяСтрока = Сведения.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСоставЗаказа.Количество;
			НоваяСтрока.Название = ТекСтрокаСоставЗаказа.Название;
			НоваяСтрока.Сумма = ТекСтрокаСоставЗаказа.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСоставЗаказа.Цена;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		ITСервис = ДанныеЗаполнения.ITСервис;
		Телефон = ДанныеЗаполнения.ITСервис.Телефон;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Склад = ДанныеЗаполнения.Склад;
		АдресНазначения = ДанныеЗаполнения.Склад.Адрес;
		Сумма = ДанныеЗаполнения.СоставЗаказа.Итог("Сумма");
		СпособОплаты = ДанныеЗаполнения.СпособОплаты;
		Заказ = ДанныеЗаполнения.Ссылка;
		ВидНакладной = Перечисления.ВидыНакладной.Приходная;
		Для Каждого ТекСтрокаСоставЗаказа Из ДанныеЗаполнения.СоставЗаказа Цикл
			НоваяСтрока = Сведения.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСоставЗаказа.Количество;
			НоваяСтрока.Название = ТекСтрокаСоставЗаказа.Название;
			НоваяСтрока.Сумма = ТекСтрокаСоставЗаказа.Сумма;
			НоваяСтрока.Цена = ТекСтрокаСоставЗаказа.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, Режим)     
	
	Если ВидНакладной = Перечисления.ВидыНакладной.Расходная Тогда  	
		
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		Движения.Записать();   
		
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;   
		ЭлементБлокировки.ИсточникДанных = Сведения;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Название");
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладнаяСведения.Название КАК Номенклатура,
		|	НакладнаяСведения.Количество КАК Количество
		|ПОМЕСТИТЬ втТЧТовары
		|ИЗ
		|	Документ.Накладная.Сведения КАК НакладнаяСведения
		|ГДЕ
		|	НакладнаяСведения.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧТовары.Номенклатура КАК Номенклатура,
		|	втТЧТовары.Номенклатура.Представление КАК НоменклатураПредставление,
		|	втТЧТовары.Количество КАК Количество,
		|	ОстаткиНоменклатурыОстатки.ITСервис КАК ITСервис,
		|	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СебестоимостьОстаток, 0) КАК СебестоимостьОстаток,
		|	ВЫБОР
		|		КОГДА ОстаткиНоменклатурыОстатки.Склад = &Склад
		|			ТОГДА -1
		|		ИНАЧЕ ЕСТЬNULL(ПриоритетыСкладовСрезПоследних.Приоритет, 100)
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	втТЧТовары КАК втТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							втТЧТовары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							втТЧТовары КАК втТЧТовары)
		|					И ITСервис = &ITСервис
		|					И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПриоритетыСкладов.СрезПоследних(&МоментВремени, ) КАК ПриоритетыСкладовСрезПоследних
		|			ПО ОстаткиНоменклатурыОстатки.ITСервис = ПриоритетыСкладовСрезПоследних.Склад.ITСервис
		|				И ОстаткиНоменклатурыОстатки.Склад = ПриоритетыСкладовСрезПоследних.Склад
		|		ПО втТЧТовары.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());  
		Запрос.УстановитьПараметр("ITСервис", ITСервис);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Недостаточно товара %1 в количестве %2",
				ВыборкаНоменклатура.НоменклатураПредставление,
				ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			КоличествоСписать = ВыборкаНоменклатура.Количество;
			
			ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() И КоличествоСписать > 0 Цикл                        
				
				Количество = Мин(КоличествоСписать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
				
				Если Количество  = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
					Себестоимость = ВыборкаДетальныеЗаписи.СебестоимостьОстаток;
				Иначе
					Себестоимость = Количество / ВыборкаДетальныеЗаписи.КоличествоОстаток * ВыборкаДетальныеЗаписи.СебестоимостьОстаток;
				КонецЕсли;
				
				Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
				Движение.Период = Дата;
				Движение.Количество = Количество;
				Движение.Себестоимость = Себестоимость;
				
				КоличествоСписать = КоличествоСписать - Количество;  
			КонецЦикла;                                              
		КонецЦикла;
		
		// регистр Заказы 
		Движения.Заказы.Записывать = Истина;
		Для Каждого ТекСтрокаСведения Из Сведения Цикл
			Движение = Движения.Заказы.Добавить();
			Движение.Период = Дата;
			Движение.ITСервис = ITСервис;
			Движение.Номенклатура = ТекСтрокаСведения.Название;
			Движение.Клиент = Контрагент;
			Движение.Цена = ТекСтрокаСведения.Цена;
			Движение.Количество = ТекСтрокаСведения.Количество;
			Движение.Сумма = ТекСтрокаСведения.Сумма;
		КонецЦикла;
		// Перебираем все документы "ЗаказКлиента"
		ЗаказыКлиентов = Документы.ЗаказКлиента.Выбрать();
		НайденЗаказ = Ложь;
		
		Пока ЗаказыКлиентов.Следующий() Цикл
			// Проверяем, соответствует ли текущий заказ нужному
			Если ЗаказыКлиентов.Ссылка = Заказ Тогда
				НайденЗаказ = Истина;
				ЗакПокРек = ЗаказыКлиентов.ПолучитьОбъект();
				
				// Проверяем статус заказа
				// Переходим к проверке оплат
				ОплатыКлиентов = Документы.Оплата.Выбрать();
				НайденаОплата = Ложь;
				
				Пока ОплатыКлиентов.Следующий() Цикл
					Если ОплатыКлиентов.Заказ = Заказ Тогда
						НайденаОплата = Истина;
						ОплКлРек = ОплатыКлиентов.ПолучитьОбъект();
						
						Если ОплКлРек.Проведен = Ложь Тогда
							Сообщить("Документ не может быть проведен, т.к товар еще не оплачен.");
							Отказ = Истина;
							Возврат;
						КонецЕсли;
						Прервать; // Оплата найдена, выходим из цикла
					КонецЕсли;
				КонецЦикла;
				
				// Если оплата не найдена, сообщаем об этом
				Если Не НайденаОплата Тогда
					Сообщить("Документ не может быть проведен, т.к товар еще не оплачен.");
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				
				// Обновляем статус заказа
				ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.Выдан;
				ЗакПокРек.ДатаВыдачи = Дата;
				ЗакПокРек.Записать();
				Прервать; // Заказ найден и обработан, выходим из цикла
			КонецЕсли;
		КонецЦикла;
		
		// Если заказ не найден, выводим сообщение
		Если Не НайденЗаказ Тогда
			Сообщить("Документ не найден.");
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли ВидНакладной = Перечисления.ВидыНакладной.Приходная Тогда
		
		// регистр ОстаткиНоменклатуры приход
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		Для каждого ТекСтрокаСведения Из Сведения Цикл
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;   
			Движение.ITСервис = ITСервис;             
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаСведения.Название;
			Движение.Количество = ТекСтрокаСведения.Количество;  
			Движение.Себестоимость = ТекСтрокаСведения.Сумма;
		КонецЦикла;
		
		// регистр Поставки Приход
		Движения.Поставки.Записывать = Истина;
		Для Каждого ТекСтрокаСведения Из Сведения Цикл
			Движение = Движения.Поставки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ITСервис = ITСервис;
			Движение.Поставщик = Контрагент;  
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаСведения.Название;
			Движение.Цена = ТекСтрокаСведения.Цена;
			Движение.Количество = ТекСтрокаСведения.Количество;
			Движение.Сумма = ТекСтрокаСведения.Сумма;
		КонецЦикла;                 
		
		// регистр ДвиженияДенежныхСредств Приход
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ITСервис = ITСервис;
		Если СпособОплаты = Перечисления.СпособыОплаты.Наличные Тогда
			Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Иначе
			Движение.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
		КонецЕсли;
		Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставок;
		Движение.СуммаРасход = Сумма;	
	КонецЕсли;
	
КонецПроцедуры
